### Task: Pandas Practice

#### Name: Ayesha

**Importing pandas and numpy libraries**

In [3]:
import pandas as pd
import numpy as np

### Object Creation

**Series: 1-dimensional array that holds data of any type**

In [5]:
A = pd.Series([1,2, 3,4, 5, np.nan, 6,7, 8])

In [6]:
A

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
6    6.0
7    7.0
8    8.0
dtype: float64

**DataFrame: a 2-dimensional array or table containing rows and columns**

In [7]:
dates = pd.date_range("20240920", periods=6)
dates

DatetimeIndex(['2024-09-20', '2024-09-21', '2024-09-22', '2024-09-23',
               '2024-09-24', '2024-09-25'],
              dtype='datetime64[ns]', freq='D')

In [31]:
data0 = pd.DataFrame(np.random.randn(6, 6), index=dates, columns=list("ABCDEF"))
data0

                   A         B         C         D         E         F
2024-09-20 -0.228501 -1.352234  0.884115 -0.956125 -0.010918 -0.534390
2024-09-21 -1.055443  0.422063 -1.050335  0.674446  0.535491 -1.268772
2024-09-22 -0.456465  0.172953  0.802400 -0.714876  0.166095 -0.493125
2024-09-23  1.312540  1.133454 -0.806978 -0.497777 -0.176914 -1.040421
2024-09-24  0.955571 -1.625736 -1.114033  1.278289  0.581519  1.602257
2024-09-25  0.686088 -0.739885 -0.511717 -1.182172 -0.081862  0.435024

In [5]:
data = pd.DataFrame(
    {
        "A": 5.0,
        "B": pd.Timestamp("20240920"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([10] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "validate", "learn"]),
        "F": "panda",
    }
)
data

     A          B    C   D         E      F
0  5.0 2024-09-20  1.0  10      test  panda
1  5.0 2024-09-20  1.0  10     train  panda
2  5.0 2024-09-20  1.0  10  validate  panda
3  5.0 2024-09-20  1.0  10     learn  panda

**The columns of DataFrame have different datatypes: dtypes**

In [10]:
data.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

### Viewing data

**Use DataFrame.head() , DataFram.tail() to view top and bottom data**

In [11]:
data.head()

     A          B    C   D         E      F
0  5.0 2024-09-20  1.0  10      test  panda
1  5.0 2024-09-20  1.0  10     train  panda
2  5.0 2024-09-20  1.0  10  validate  panda
3  5.0 2024-09-20  1.0  10     learn  panda

In [15]:
data.tail(2)

     A          B    C   D         E      F
2  5.0 2024-09-20  1.0  10  validate  panda
3  5.0 2024-09-20  1.0  10     learn  panda

In [16]:
data.index

Index([0, 1, 2, 3], dtype='int64')

In [17]:
data.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [19]:
data.to_numpy()

array([[5.0, Timestamp('2024-09-20 00:00:00'), 1.0, 10, 'test', 'panda'],
       [5.0, Timestamp('2024-09-20 00:00:00'), 1.0, 10, 'train', 'panda'],
       [5.0, Timestamp('2024-09-20 00:00:00'), 1.0, 10, 'validate',
        'panda'],
       [5.0, Timestamp('2024-09-20 00:00:00'), 1.0, 10, 'learn', 'panda']],
      dtype=object)

In [20]:
data.describe()

         A                    B    C     D
count  4.0                    4  4.0   4.0
mean   5.0  2024-09-20 00:00:00  1.0  10.0
min    5.0  2024-09-20 00:00:00  1.0  10.0
25%    5.0  2024-09-20 00:00:00  1.0  10.0
50%    5.0  2024-09-20 00:00:00  1.0  10.0
75%    5.0  2024-09-20 00:00:00  1.0  10.0
max    5.0  2024-09-20 00:00:00  1.0  10.0
std    0.0                  NaN  0.0   0.0

In [21]:
data.T

,0,1,2,3
A,5.0,5.0,5.0,5.0
B,2024-09-20 00:00:00,2024-09-20 00:00:00,2024-09-20 00:00:00,2024-09-20 00:00:00
C,1.0,1.0,1.0,1.0
D,10,10,10,10
E,test,train,validate,learn
F,panda,panda,panda,panda

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[s]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[s](1), float32(1), float64(1), int32(1), object(1)
memory usage: 540.0+ bytes

In [33]:
data0.mean()

A    0.202298
B   -0.331564
C   -0.299425
D   -0.233036
E    0.168902
F   -0.216571
dtype: float64

In [34]:
data0.median()

A    0.228794
B   -0.283466
C   -0.659348
D   -0.606326
E    0.077588
F   -0.513758
dtype: float64

In [35]:
data0.mode()

          A         B         C         D         E         F
0 -1.055443 -1.625736 -1.114033 -1.182172 -0.176914 -1.268772
1 -0.456465 -1.352234 -1.050335 -0.956125 -0.081862 -1.040421
2 -0.228501 -0.739885 -0.806978 -0.714876 -0.010918 -0.534390
3  0.686088  0.172953 -0.511717 -0.497777  0.166095 -0.493125
4  0.955571  0.422063  0.802400  0.674446  0.535491  0.435024
5  1.312540  1.133454  0.884115  1.278289  0.581519  1.602257

In [24]:
data.sort_index(axis=1, ascending=False)

       F         E   D    C          B    A
0  panda      test  10  1.0 2024-09-20  5.0
1  panda     train  10  1.0 2024-09-20  5.0
2  panda  validate  10  1.0 2024-09-20  5.0
3  panda     learn  10  1.0 2024-09-20  5.0

In [25]:
data.sort_values(by="E")

     A          B    C   D         E      F
3  5.0 2024-09-20  1.0  10     learn  panda
0  5.0 2024-09-20  1.0  10      test  panda
1  5.0 2024-09-20  1.0  10     train  panda
2  5.0 2024-09-20  1.0  10  validate  panda

### Selection

In [27]:
data["B"]

0   2024-09-20
1   2024-09-20
2   2024-09-20
3   2024-09-20
Name: B, dtype: datetime64[s]

In [28]:
data[0:3]

     A          B    C   D         E      F
0  5.0 2024-09-20  1.0  10      test  panda
1  5.0 2024-09-20  1.0  10     train  panda
2  5.0 2024-09-20  1.0  10  validate  panda

**Selection by label**

In [11]:
data.loc[:, ["A", "B"]]

     A          B
0  5.0 2024-09-20
1  5.0 2024-09-20
2  5.0 2024-09-20
3  5.0 2024-09-20

In [14]:
data.loc["20130102":"20130104", ["A", "B"]]

Empty DataFrame
Columns: [A, B]
Index: []

**Selection by position**

In [17]:
data.iloc[3]

A                    5.0
B    2024-09-20 00:00:00
C                    1.0
D                     10
E                  learn
F                  panda
Name: 3, dtype: object

In [18]:
data.iloc[3:5, 0:2]

     A          B
3  5.0 2024-09-20

In [19]:
data.iloc[1:3, :]

     A          B    C   D         E      F
1  5.0 2024-09-20  1.0  10     train  panda
2  5.0 2024-09-20  1.0  10  validate  panda

In [20]:
data.iloc[:, 1:3]

           B    C
0 2024-09-20  1.0
1 2024-09-20  1.0
2 2024-09-20  1.0
3 2024-09-20  1.0

In [21]:
data.iloc[1, 1]

Timestamp('2024-09-20 00:00:00')

In [22]:
data.iat[1, 1]

Timestamp('2024-09-20 00:00:00')

**Boolean indexing**

In [23]:
data[data["A"] > 0]

     A          B    C   D         E      F
0  5.0 2024-09-20  1.0  10      test  panda
1  5.0 2024-09-20  1.0  10     train  panda
2  5.0 2024-09-20  1.0  10  validate  panda
3  5.0 2024-09-20  1.0  10     learn  panda

**Setting**

In [29]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [30]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [31]:
data["F"] = s1

**Value Counts**

In [37]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [38]:
s

0    0
1    2
2    2
3    4
4    1
5    3
6    0
7    6
8    3
9    0
dtype: int32

In [39]:
s.value_counts()

0    3
2    2
3    2
4    1
1    1
6    1
Name: count, dtype: int64

**String Methods**

In [40]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

In [41]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

**Join**

In [42]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

In [43]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [44]:

left

   key  lval
0  foo     1
1  foo     2

In [45]:
right

   key  rval
0  foo     4
1  foo     5

In [46]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

**Grouping**

In [47]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)


df

     A      B         C         D
0  foo    one  0.862070 -0.600616
1  bar    one  0.075128  0.057918
2  foo    two  1.230091  0.023540
3  bar  three -0.193802 -0.293433
4  foo    two -1.109709 -0.869544
5  bar    two -0.071815  0.599639
6  foo    one  0.941791 -1.186423
7  foo  three -1.461089  1.288559

**Categoricals**

In [48]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)

In [49]:
df["grade"] = df["raw_grade"].astype("category")

df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [50]:
df["grade"] = df["grade"].cat.set_categories(
    ["very bad", "bad", "medium", "good", "very good"]
)


df["grade"]

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [51]:
df.sort_values(by="grade")

   id raw_grade grade
0   1         a   NaN
1   2         b   NaN
2   3         b   NaN
3   4         a   NaN
4   5         a   NaN
5   6         e   NaN

In [52]:
df.groupby("grade", observed=False).size()

grade
very bad     0
bad          0
medium       0
good         0
very good    0
dtype: int64